author: Zach Mathis
date: 2020/11/08
modified: 2022/12/16

title: 'Logon (Interactive) *Creds in memory*'
description: 'Type 2 Interactive logons can be dangerous as the credentials (plaintext or hashed passwords) are stored in memory (lsass process) and can be stolen by tools like mimikatz.'

id: 7beb4832-f357-47a4-afd8-803d69a5c85c
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 2
    filter:
        IpAddress: "-"
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
references:
ruletype: Hayabusa

sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft-Windows-Security-Auditing" Guid="{54849625-5478-4994-a5ba-3e3b0328c30d}" />
            <EventID>4624</EventID>
            <Version>3</Version>
            <Level>0</Level>
            <Task>12544</Task>
            <Opcode>0</Opcode>
            <Keywords>0x8020000000000000</Keywords>
            <TimeCreated SystemTime="2023-06-05T07:39:45.6089120Z" />
            <EventRecordID>98183</EventRecordID>
            <Correlation ActivityID="{8227fe63-9780-0003-07ff-27828097d901}" />
            <Execution ProcessID="884" ThreadID="972" />
            <Channel>Security</Channel>
            <Computer>memanalysis</Computer>
            <Security />
        </System>
        <EventData>
            <Data Name="SubjectUserSid">S-1-5-18</Data>
            <Data Name="SubjectUserName">MEMANALYSIS$</Data>
            <Data Name="SubjectDomainName">WORKGROUP</Data>
            <Data Name="SubjectLogonId">0x3e7</Data>
            <Data Name="TargetUserSid">S-1-5-21-3297717791-1189016798-2854365951-1001</Data>
            <Data Name="TargetUserName">user</Data>
            <Data Name="TargetDomainName">memanalysis</Data>
            <Data Name="TargetLogonId">0xe6454</Data>
            <Data Name="LogonType">2</Data>
            <Data Name="LogonProcessName">User32</Data>
            <Data Name="AuthenticationPackageName">Negotiate</Data>
            <Data Name="WorkstationName">MEMANALYSIS</Data>
            <Data Name="LogonGuid">{00000000-0000-0000-0000-000000000000}</Data>
            <Data Name="TransmittedServices">-</Data>
            <Data Name="LmPackageName">-</Data>
            <Data Name="KeyLength">0</Data>
            <Data Name="ProcessId">0x670</Data>
            <Data Name="ProcessName">C:\Windows\System32\svchost.exe</Data>
            <Data Name="IpAddress">127.0.0.1</Data>
            <Data Name="IpPort">0</Data>
            <Data Name="ImpersonationLevel">%%1833</Data>
            <Data Name="RestrictedAdminMode">-</Data>
            <Data Name="RemoteCredentialGuard">-</Data>
            <Data Name="TargetOutboundUserName">-</Data>
            <Data Name="TargetOutboundDomainName">-</Data>
            <Data Name="VirtualAccount">%%1843</Data>
            <Data Name="TargetLinkedLogonId">0xe64d4</Data>
            <Data Name="ElevatedToken">%%1842</Data>
        </EventData>
    </Event>