author: Zach Mathis
date: 2022/06/08
modified: 2023/06/08

title: 'Logon (Service) (Noisy)'
description: 'System Noise'

id: 84e5ff02-5f8f-48c4-a7e9-88aa1fb888f7
level: info
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 5
    selection_system_noise:
        TargetUserName:
            - "SYSTEM"
            - "NETWORK SERVICE"
            - "LOCAL SERVICE"
    condition: selection and selection_system_noise
falsepositives:
    - normal system usage
tags:
references:
ruletype: Hayabusa

sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft-Windows-Security-Auditing" Guid="{54849625-5478-4994-a5ba-3e3b0328c30d}" />
            <EventID>4624</EventID>
            <Version>3</Version>
            <Level>0</Level>
            <Task>12544</Task>
            <Opcode>0</Opcode>
            <Keywords>0x8020000000000000</Keywords>
            <TimeCreated SystemTime="2023-06-08T23:19:35.3001157Z" />
            <EventRecordID>101786</EventRecordID>
            <Correlation ActivityID="{8227fe63-9780-0003-07ff-27828097d901}" />
            <Execution ProcessID="884" ThreadID="6156" />
            <Channel>Security</Channel>
            <Computer>memanalysis</Computer>
            <Security />
        </System>
        <EventData>
            <Data Name="SubjectUserSid">S-1-5-18</Data>
            <Data Name="SubjectUserName">MEMANALYSIS$</Data>
            <Data Name="SubjectDomainName">WORKGROUP</Data>
            <Data Name="SubjectLogonId">0x3e7</Data>
            <Data Name="TargetUserSid">S-1-5-18</Data>
            <Data Name="TargetUserName">SYSTEM</Data>
            <Data Name="TargetDomainName">NT AUTHORITY</Data>
            <Data Name="TargetLogonId">0x3e7</Data>
            <Data Name="LogonType">5</Data>
            <Data Name="LogonProcessName">Advapi</Data>
            <Data Name="AuthenticationPackageName">Negotiate</Data>
            <Data Name="WorkstationName">-</Data>
            <Data Name="LogonGuid">{00000000-0000-0000-0000-000000000000}</Data>
            <Data Name="TransmittedServices">-</Data>
            <Data Name="LmPackageName">-</Data>
            <Data Name="KeyLength">0</Data>
            <Data Name="ProcessId">0x30c</Data>
            <Data Name="ProcessName">C:\Windows\System32\services.exe</Data>
            <Data Name="IpAddress">-</Data>
            <Data Name="IpPort">-</Data>
            <Data Name="ImpersonationLevel">%%1833</Data>
            <Data Name="RestrictedAdminMode">-</Data>
            <Data Name="RemoteCredentialGuard">-</Data>
            <Data Name="TargetOutboundUserName">-</Data>
            <Data Name="TargetOutboundDomainName">-</Data>
            <Data Name="VirtualAccount">%%1843</Data>
            <Data Name="TargetLinkedLogonId">0x0</Data>
            <Data Name="ElevatedToken">%%1842</Data>
        </EventData>
    </Event>